#+TITLE: Taller: Aritmética Digital y Representación Numérica
#+AUTHOR: Lenin G. Falconí
#+DATE: 2026-04-24
#+email: lenin.falconi@epn.edu.ec
#+OPTIONS: toc:2 num:t
#+STARTUP: overview

#+cite_export: biblatex
#+bibliography: ../bibliography/bibliography.bib


#+begin_comment
,* Instrucciones Generales
- Resuelva todas las /Preguntas de Repaso/ y los /Problemas Propuestos/.
- Utilice notación clara: indique siempre el número de bits y el formato
  utilizado: *signo-magnitud*, *complemento a 1*, *complemento a 2*,
  ,*representación sesgada* y *coma flotante* (IEEE 754) según sea el caso.
- Entregue este archivo =.org= con sus respuestas debidamente justificadas.
- Puede usar bloques de código =python= o =calc= de Emacs para verificaciones.
#+end_comment
\newpage
** Complemento a base disminuida
Sea \(r \ge 2\) la base, \(n \in \mathbb{N}\), el número de dígitos[fn:1], y
\(x \in \mathbb{Z}\) en *base 10* tal que
\[
-(r^{n-1}-1) \le x \le r^{n-1}-1.
\]

Definimos la representación en complemento a base disminuida \((r-1)\) como
#+begin_export latex
\begin{equation}
C_{r-1}^{(n)}(x) =
\begin{cases}
\begin{aligned}
&x, && 0 \le x \le r^{n-1}-1,\\
&(r^n - 1) - \lvert x \rvert, && -(r^{n-1}-1) \le x < 0.
\end{aligned}
\end{cases}
\end{equation}

#+end_export
Entonces podemos escribir el siguiente código para $r=2$
#+begin_src python :session t1 :results output :exports both
x = -15
n = 8
r = 2
limit_inferior = -(r**(n-1)-1)
limit_superior = r**(n-1)-1
# Verificar si el número esta en el rango
if  limit_inferior <= x <= limit_superior:
    # el complemento a 1 de X es:
    cmpl_1_dec = x
    if x  < 0:
        cmpl_1_dec = (r**n-1)-abs(x)
    # para expresar en binario de 8 bits
    cmpl_1_bin = format(cmpl_1_dec, '08b')
    cmpl_1_hex = format(cmpl_1_dec, '02X')
    print(f"La representación en complemento a {r-1} de {x} es:")
    print(f"{cmpl_1_bin} en base {r}")
    print(f"{cmpl_1_hex} en base 16")
else:
    print(f"{x} fuera de rango [{limit_inferior},{limit_superior}]")


#+end_src

#+RESULTS:
: La representación en complemento a 1 de -15 es:
: 11110000 en base 2
: F0 en base 16

También se puede obtener similar resultado restando el número $x$ de
un número formado por $n$ dígitos de $r-1$. El siguiente código es
para $r=2$

#+begin_src python :session t1 :results output :exports both

if  limit_inferior <= x <= limit_superior:
    # el complemento a 1 de X es:
    cmpl_1_dec = x
    if x  < 0:
        x_mod = abs(x)
        x_mod_bin = format(x_mod, '08b') # solo para r = 2
        print(f"|{x}| equivale en base {r} a :{x_mod_bin}")
        # genero una cadena con n digitos de valor r-1
        M = f"{r-1}"*n
        print(f"Restar {x_mod_bin} de {M}")
        cmpl_1_dec = int(M,r)-int(x_mod_bin,r)
    cmpl_1_bin = format(cmpl_1_dec, f'0{n}b')
    cmpl_1_hex = format(cmpl_1_dec, f'0{n//4}X')
    print(f"La representación en complemento a {r-1} de {x} es:")
    print(f"{cmpl_1_bin} en base {r}")
    print(f"{cmpl_1_hex} en base 16")
else:
    print(f"{x} fuera de rango [{limit_inferior},{limit_superior}]")
#+end_src

#+RESULTS:
: |-15| equivale en base 2 a :00001111
: Restar 00001111 de 11111111
: La representación en complemento a 1 de -15 es:
: 11110000 en base 2
: F0 en base 16
** Complemento a la base
Sea \(r \ge 2\) la base, \(n \in \mathbb{N}\) el número de dígitos
y \(x \in \mathbb{Z}\) tal que

\[
-r^{n-1} \le x \le r^{n-1}-1.
\]

Definimos la representación en complemento a la base \(r\)
(r-complement) como

#+begin_export latex
\begin{equation}
  \label{eq:r_complement}
  C_r^{(n)}(x) =
  \left\{
    \begin{aligned}
      x,          &\quad 0 \le x \le r^{n-1} - 1,\\
      r^n - |x|,  &\quad -r^{n-1} \le x < 0.
    \end{aligned}
  \right.
\end{equation}
#+end_export


#+begin_src python :session t1 :results output :exports both

limit_inferior = -(r**(n-1))
limit_superior = r**(n-1) - 1

if limit_inferior <= x <= limit_superior:
    # Two's complement conversion
    cmpl_2_dec = x if x >= 0 else (r**n - abs(x))
    cmpl_2_bin = format(cmpl_2_dec, f'0{n}b')
    cmpl_2_hex = format(cmpl_2_dec, f'0{n//4}X')
    
    print(f"La representación en complemento a {r} de {x} es:")
    print(f"{cmpl_2_bin} en base {r}")
    print(f"{cmpl_2_hex} en base 16")
else:
    print(f"{x} fuera de rango [{limit_inferior},{limit_superior}]")
#+end_src

#+RESULTS:
: La representación en complemento a 2 de -15 es:
: 11110001 en base 2
: F1 en base 16

Se puede programar la representación de complemento a 2 para verificar
el resultado, usando

\[
x = -b_{i-1}\times 2^{n-1}+\sum_i=0^{n-2}b_i\times 2^i
\]

#+begin_src python :session t1 :results output :exports both

def complemento2_a_decimal(bin_str):
    n = len(bin_str)
    b = [int(bit) for bit in bin_str]
    b = b[::-1]
    # -b[n-1] * 2^(n-1) + sum(b[i] * 2^i for i in 0..n-2)
    result = -b[n-1] * (2 ** (n-1))
    for i in range(n-1):
        result += b[i] * (2 ** i)
    return result

# Example
x_ = complemento2_a_decimal(cmpl_2_bin)
print(f"El equivalente decimal de {cmpl_2_bin} en complemento a {r} es {x_}")

#+end_src

#+RESULTS:
: El equivalente decimal de 11110001 en complemento a 2 es -15

De manera similar podemos establecer la relación siguiente:
\[
C_r^{(n)}(x) = C_{r-1}^{(n)}(x) + 1
\]

#+begin_src python :session t1 :results output :exports both
if limit_inferior <= x <= limit_superior:
    # Handle zero and positive numbers (same as original)
    if x >= 0:
        cmpl_2_dec = x
        cmpl_2_bin = format(cmpl_2_dec, '08b')
        cmpl_2_hex = format(cmpl_2_dec, '02X')
    else:
        # Step 1: one's complement
        x_mod = abs(x)
        M = f"{r-1}"*n          # funciona si r = 2
        ones_complement_dec = int(M, r) - int(x_mod_bin, r)
        
        # Step 2: add 1 to get two's complement
        cmpl_2_dec = ones_complement_dec + 1
    
    cmpl_2_bin = format(cmpl_2_dec, f'0{n}b')
    cmpl_2_hex = format(cmpl_2_dec, f'0{n//4}X')
    
    print(f"La representación en complemento a {r} de {x} es:")
    print(f"{cmpl_2_bin} en base {r}")
    print(f"{cmpl_2_hex} en base 16")
else:
    print(f"{x} fuera de rango [{limit_inferior},{limit_superior}]")
#+end_src

#+RESULTS:
: La representación en complemento a 2 de -15 es:
: 11110001 en base 2
: F1 en base 16

Un análisis similar puede hacerse para la representación *Signo
Magnitud*. Pruebe a desarrollar programas que le permitan resolver los
cálculos de los ejercicios. También, el código puede ser generalizado
para trabajar sobre cualquier $r$. En estos ejemplos presentados, se
ha escrito con $r=2$ en mente.
